{
    "filmes": [
        {
            "id": 1,
            "title": "Episodio I",
            "subtitle": "A Ameaça Fantasma",
            "description": "Star Wars: Episódio I – A Ameaça Fantasma[2][3][4][5] (em inglês: Star Wars: Episode I – The Phantom Menace) é um filme épico de space opera estadunidense, pertencente a série de filmes Star Wars, lançado em 1999, dirigido e escrito por George Lucas. É o primeiro filme da trilogia prequela e o quarto da série rodado, embora o primeiro em ordem cronológica. Foi estrelado por Liam Neeson, Ewan McGregor, Natalie Portman, Jake Lloyd, Ian McDiarmid, Anthony Daniels, Kenny Baker, Pernilla August e Frank Oz. Ameaça Fantasma ocorre cerca de 32 anos antes do filme original, e segue o Mestre Jedi Qui-Gon Jinn e seu padawan Obi-Wan Kenobi, como protetores da Rainha Amidala, na esperança de conseguir um fim pacífico para uma disputa comercial interplanetária de grande escala. Em sua jornada juntam-se a eles Anakin Skywalker—um jovem escravo com forte conexão com a Força—simultaneamente com o retorno dos misteriosos Sith. Lucas começou a produção deste filme depois de considerar que os efeitos especiais tinham avançado suficiente para ele produzir uma nova trilogia da série. As filmagens começaram em 26 de junho de 1997, em locais como o Leavesden Film Studios e o deserto da Tunísia. Os efeitos visuais incluíram o uso extensivo do até então novo imagens geradas por computador (CGI). Ameaça Fantasma foi o primeiro trabalho de direção do Lucas após um hiato de 22 anos desde Star Wars em 1977. A Ameaça Fantasma foi lançado nos cinemas em 19 de maio de 1999, dezesseis anos desde a última estreia de um filme da franquia, Return of the Jedi. A estreia do filme recebeu ampla cobertura da imprensa e alta antecipação, por causa do largo impacto cultural que a saga Star Wars tem cultivado. Recebeu críticas medianas dos especialistas, que tendiam a elogiar o visual, sequências de ação, trilha sonora de John Williams e performances de Liam Neeson, Ewan McGregor, Pernilla August, Ray Park e Ian McDiarmid, mas criticaram o roteiro e direção de elenco (particularmente de Ahmed Best e Jake Lloyd). Arrecadou 924,3 milhões de dólares ao redor do mundo em sua estreia, tornando-se na época a segunda maior bilheteria de todos os tempos, atrás apenas de Titanic. Foi a maior bilheteria de 1999, a maior bilheteria de um filme de Star Wars (até o lançamento de Star Wars: O Despertar da Força em 2015), e é atualmente a 41º maior bilheteria de todos os tempos. O relançamento em 3D em fevereiro de 2012, adicionou US$ 102,7 milhões em sua receita, chegando a US$ 1 bilhão mundialmente. O filme foi seguido pelas continuações, Star Wars: Episódio II – Ataque dos Clones em 2002 e Star Wars: Episódio III – A Vingança dos Sith em 2005.",
            "image_url": "https://upload.wikimedia.org/wikipedia/pt/thumb/3/30/Star_Wars_Epis%C3%B3dio_1_Amea%C3%A7a_Fantasma.jpg/240px-Star_Wars_Epis%C3%B3dio_1_Amea%C3%A7a_Fantasma.jpg",
            "trailer_url": "https://www.youtube.com/watch?v=bD7bpG-zDJQ"
        },
        {
            "id": 2,
            "title": "Episodio II",
            "subtitle": "Ataque dos Clones",
            "description": "Star Wars: Episode II – Attack of the Clones (bra: Star Wars: Episódio 2 – Ataque dos Clones[4], ou Star Wars: Episódio II – Ataque dos Clones[5]; prt: Star Wars: Episódio II – Ataque dos Clones[6][7], ou Star Wars: O Ataque dos Clones[8]) é uma space opera épica americana, pertencente a série de filmes Star Wars, lançado em 2002, dirigido por George Lucas e com roteiro de Lucas e Jonathan Hales. É o segundo filme da trilogia prequela de Star Wars, estrelado por Ewan McGregor, Natalie Portman, Hayden Christensen, Ian McDiarmid, Samuel L. Jackson, Christopher Lee, Temuera Morrison, Anthony Daniels, Kenny Baker, e Frank Oz.O filme ocorre 10 anos após os acontecimentos de Star Wars Episódio I: A Ameaça Fantasma. A galáxia está à beira de uma guerra civil. Liderado por um ex-Jedi chamado Conde Dooku, milhares de sistemas planetários ameaçam deixar a República Galáctica. Após a senadora Padmé Amidala escapar de uma tentativa de assassinato, Anakin Skywalker, um aprendiz Jedi, se torna seu protetor, enquanto seu mestre Obi-Wan Kenobi, investiga o atentado contra a vida dela. Logo Anakin, Padmé, e Obi-Wan testemunham o início de uma nova ameaça à galáxia, as Guerras Clônicas.",
            "image_url": "https://upload.wikimedia.org/wikipedia/pt/thumb/6/63/Star_Wars_The_Clone_Wars.jpg/250px-Star_Wars_The_Clone_Wars.jpg",
            "trailer_url": "https://www.youtube.com/watch?v=gYbW1F_c9eM"
        },
        {
            "id": 3,
            "title": "Episódio III",
            "subtitle": "A Vingança dos Sith",
            "description": "Star Wars: Episódio III – A Vingança dos Sith[2][3][4][5] (em inglês: Star Wars: Episode III – Revenge of the Sith) é um filme americano de space opera épica, o sexto filme da série Star Wars a ser rodado e o terceiro em ordem cronológica, lançado em 2005. A terceira e última parte da trilogia prequela de Star Wars, foi dirigido e escrito por George Lucas, e estrelado por Ewan McGregor, Natalie Portman, Hayden Christensen, Ian McDiarmid, Samuel L. Jackson, Christopher Lee, Anthony Daniels, Kenny Baker e Frank Oz. O filme começa três anos após o início das Guerras Clônicas. Os Cavaleiros Jedi estão espalhados por toda a galáxia, liderando uma guerra maciça contra os Separatistas. O Conselho Jedi incumbe o Mestre Jedi Obi-Wan Kenobi de eliminar o notório General Grievous, líder do Exército Separatista. Enquanto isto, o Cavaleiro Jedi Anakin Skywalker se aproxima de Palpatine, o Supremo Chanceler da República Galáctica e, desconhecido do público, um Lord Sith. Sua amizade aprofundada ameaça a Ordem Jedi, a República, e o próprio Anakin.",
            "image_url": "https://upload.wikimedia.org/wikipedia/pt/thumb/5/58/Star_Wars_Epis%C3%B3dio_III_A_Vingan%C3%A7a_dos_Sith.jpg/250px-Star_Wars_Epis%C3%B3dio_III_A_Vingan%C3%A7a_dos_Sith.jpg",
            "trailer_url": "https://www.youtube.com/watch?v=5UnjrG_N8hU"
        },
        {
            "id": 4,
            "title": "Episódio IV",
            "subtitle": "Uma Nova Esperança",
            "description": "Star Wars (Guerra nas Estrelas no Brasil e A Guerra das Estrelas em Portugal), mais tarde relançado como Star Wars: Episode IV – A New Hope (Star Wars: Episódio IV – Uma Nova Esperança em português) é um filme épico/space opera norte-americano, o primeiro da saga homônima a ser lançado em 25 de maio de 1977, e o quarto na ordem cronológica da trama, escrito e dirigido por George Lucas. Conta a história do jovem fazendeiro Luke Skywalker (Mark Hamill), que, após adquirir dois droids (robôs), envolve-se na Guerra Civil Galáctica entre o tirano Império Galáctico e a Aliança Rebelde, ao lado do contrabandista Han Solo (Harrison Ford). Um dos robôs contém na memória o projeto secreto da super arma do Império, Estrela da Morte, roubado pelos rebeldes e inserido no droid por sua líder, Princesa Leia (Carrie Fisher), que com isso espera destruir o Império e salvar a galáxia.",
            "image_url": "https://upload.wikimedia.org/wikipedia/pt/thumb/7/7e/Star_Wars_Epis%C3%B3dio_IV_Uma_Nova_Esperan%C3%A7a.jpg/243px-Star_Wars_Epis%C3%B3dio_IV_Uma_Nova_Esperan%C3%A7a.jpg",
            "trailer_url": "https://www.youtube.com/watch?v=vZ734NWnAHA"
        },
        {
            "id": 5,
            "title": "Episódio V",
            "subtitle": "O Império Contra-Ataca",
            "description": "Guerra nas Estrelas: O Império Contra-Ataca (em inglês: The Empire Strikes Back), posteriormente lançado como Star Wars: Episódio V - O Império Contra-Ataca (em inglês: Star Wars: Episode V - The Empire Strikes Back), é um filme épico/space opera norte-americano de 1980 dirigido por Irvin Kershner e escrito por Leigh Brackett e Lawrence Kasdan, com base na história de George Lucas, sendo o segundo filme da saga Star Wars a ser lançado, embora seja o quinto na ordem cronológica. O filme é ambientado três anos depois de Guerra nas Estrelas. O Império Galáctico, sob a liderança do vilão Darth Vader e do misterioso Imperador, está em busca de Luke Skywalker e o resto da Aliança Rebelde. Enquanto Vader procura incansavelmente o pequeno grupo de amigos de Luke — Han Solo, Princesa Leia Organa e outros — através da galáxia, Luke é ensinado pelo Mestre Yoda a como usar a Força. Quando Vader captura os amigos de Luke, Luke deve decidir se vai completar seu treinamento e se tornar um Cavaleiro Jedi completo ou confrontar Vader e salvá-los.",
            "image_url": "https://upload.wikimedia.org/wikipedia/pt/thumb/5/5c/The_Empire_Strikes_Back.jpg/250px-The_Empire_Strikes_Back.jpg",
            "trailer_url": "https://www.youtube.com/watch?v=JNwNXF9Y6kY"
        },
        {
            "id": 6,
            "title": "Solo",
            "subtitle": "Uma História Star Wars",
            "description": "Solo: A Star Wars Story ou simplesmente Solo (no Brasil, Han Solo: Uma História Star Wars;[10] em Portugal, Han Solo: Uma História de Star Wars[11]) é um space western estadunidense de 2018, centrada em Han Solo, personagem da saga Star Wars, produzido pela Lucasfilm Ltd. e distribuído pela Walt Disney Studios Motion Pictures, sendo o segundo título na série de antologias do universo Star Wars após Rogue One: A Star Wars Story, de 2016. Dirigido por Ron Howard e escrito por Lawrence Kasdan e Jon Kasdan, é estrelado por Alden Ehrenreich como Solo, ao lado de Woody Harrelson, Emilia Clarke, Donald Glover, Thandie Newton, Phoebe Waller-Ponte e Joonas Suotamo. O filme se passa dez anos antes dos acontecimentos em Star Wars e explora as primeiras aventuras de Han Solo e Chewbacca, incluindo o personagem Lando Calrissian. Com o título de produção Star Wars: Red Cup,[12] as filmagens ocorreram entre janeiro e outubro de 2017,[12] com a filmagem principal iniciada em 20 de fevereiro sob a direção de Phil Lord e Christopher Miller no Pinewood Studios.[13] Em 20 de junho de 2017, após quatro meses e meio de filmagens e faltando poucas semanas para o término, a dupla foi demitida pela Lucasfilm por conta de diferenças criativas.[1][3][4] Foi relatado que Lord e Miller estavam saindo do roteiro escrito por Lawrence Kasdan, co-roteirista de O Império Contra-Ataca, Return of the Jedi e O Despertar da Força, direcionando uma space opera para uma produção de comédia, estilo que foi contestado pela produtora Kathleen Kennedy, presidente da Lucasfilm e gerente de marca da franquia Star Wars. Lord e Miller acreditavam que haviam sido contratados para fazer um filme de comédia, enquanto o estúdio contratara ambos apenas para adicionar um toque cômico. A Lucasfilm também sentiu que os diretores estavam encorajando a improvisação dos atores, o que se acreditava estar mudando o foco da história do texto de Kasdan.[14] Os problemas nos bastidores da produção se agravaram um mês antes da demissão. Insatisfeita com o desempenho de Alden Ehrenreich, a Lucasfilm contratou um treinador de atuação, a roteirista e diretora Maggie Kiley. Segundo Ehrenreich, a contratação de Kiley não era na proporção relatada pela imprensa, alegando que ela fez parte de conversas que aconteceram por algumas semanas... Basicamente isso.[15] Além do fator envolvendo a estrela principal do título, o editor Chris Dickens foi substituído por Pietro Scalia, evidenciando os conflitos entre Kennedy e Kasdan com Phil Lord e Christopher Miller.[7] Ron Howard foi anunciado como o novo diretor de Solo dois dias após o anúncio do desligamento de Lord e Miller. Howard acabou assumindo três semanas e meia restantes de filmagens programadas e mais cinco semanas de refilmagens, fato que elevou substancialmente os custos de produção.[2][8]",
            "image_url": "https://upload.wikimedia.org/wikipedia/pt/thumb/5/5c/Solo_A_Star_Wars_Story.jpg/250px-Solo_A_Star_Wars_Story.jpg",
            "trailer_url": "https://www.youtube.com/watch?v=jPEYpryMp2s"
        },
        {
            "id": 7,
            "title": "Rogue One",
            "subtitle": "Uma História Star Wars",
            "description": "Rogue One: A Star Wars Story (no Brasil, Rogue One: Uma História Star Wars; em Portugal, Rogue One: Uma História de Star Wars) é um space opera épica estadunidense de ação, aventura, fantasia e ficção científica de 2016, de Gareth Edwards e escrito por Chris Weitz, sendo um derivado da franquia Star Wars, de George Lucas. O filme, que faz parte de uma nova série de spin-offs produzidos pela Lucasfilm e distribuídos mundialmente pela Walt Disney Studios Motion Pictures com base na série de filmes, teve seus efeitos especiais produzidos pela Industrial Light & Magic. A narrativa de Rogue One: A Star Wars Story é estabelecida entre os acontecimentos de A Vingança dos Sith e Uma Nova Esperança. A história do filme se baseia em um grupo de combatentes da Aliança Rebelde se unindo para uma missão de roubar os planos da Estrela da Morte. A fotografia principal teve início em Elstree Studios, no Reino Unido, durante o início de agosto de 2015 e terminou em fevereiro de 2016, com regravações e filmagens adicionais ocorrendo em meados de junho de 2016. Rogue One teve sua estreia em Los Angeles no dia 10 de dezembro de 2016, estreando nos cinemas em 15 de dezembro de 2016.[2] Seu primeiro fim de semana obteve US$ 290 milhões. O filme recebeu críticas geralmente positivas, com elogios as performances do elenco, cenas de ação, o tom mais sombrio, efeitos visuais, fotografia e a trilha sonora de Michael Giacchino. Em 22 de janeiro de 2017, o filme passou a marca de US$ 1 bilhão em bilheteria.[3] Foi um dos filmes de maior bilheteria nos Estados Unidos e Canadá com pouco mais de US$ 532 milhões. Mundialmente, conquistou a segunda colocação entre os filmes mais rentáveis de 2016, ficando atrás apenas de Captain America: Civil War.[4] Rogue One: A Star Wars Story teve duas indicações ao Oscar 2017, nas categorias de Melhor Mixagem de Som e Melhores Efeitos Visuais.",
            "image_url": "https://upload.wikimedia.org/wikipedia/pt/thumb/6/62/Rogue_One_-_A_Star_Wars_Story.jpg/250px-Rogue_One_-_A_Star_Wars_Story.jpg",
            "trailer_url": "https://www.youtube.com/watch?v=frdj1zb9sMY"
        },
        {
            "id": 8,
            "title": "Episódio VII",
            "subtitle": "O Despertar da Força",
            "description": "Star Wars: Episódio VII – O Despertar da Força (no original em inglês: Star Wars: Episode VII - The Force Awakens) é uma space opera épica estadunidense de aventura, fantasia e ficção científica de 2015, dirigida por J. J. Abrams, que também contribuiu com o roteiro ao lado de Lawrence Kasdan,[7] sendo o sétimo filme da série e da ordem cronológica Star Wars, além de ser o primeiro da trilogia sequela. Abrams ainda fez parte da equipe de produção com Bryan Burk e Kathleen Kennedy, presidente da Lucasfilm Ltd. e responsável pelos filmes da franquia. O elenco principal inclui Daisy Ridley, John Boyega, Adam Driver, Oscar Isaac, Andy Serkis, Domhnall Gleeson, e Max von Sydow, com Harrison Ford, Mark Hamill, Carrie Fisher, Anthony Daniels, Kenny Baker e Peter Mayhew reprisando seus papéis dos filmes anteriores. O Despertar da Força se passa aproximadamente trinta anos após os acontecimentos de Return of the Jedi, e acompanha a jornada de Rey, que acaba encontrando um droide, BB-8, com informações do paradeiro de Luke Skywalker que está desaparecido. Ela é acompanhada por Finn, um stormtrooper desertor da Primeira Ordem, uma organização que quer reaver o Império Galáctico e luta contra a Resistência, comandada por Leia Organa. A aventura inesperada leva Rey a descobrir sua forte conexão com a Força e enfrentar o Lado Sombrio.",
            "image_url": "https://upload.wikimedia.org/wikipedia/pt/thumb/a/ae/Starwars_06.jpg/250px-Starwars_06.jpg",
            "trailer_url": "https://www.youtube.com/watch?v=sGbxmsDFVnE"
        },
        {
            "id": 9,
            "title": "Episódio VIII",
            "subtitle": "Os Últimos Jedi ",
            "description": "Star Wars: Episódio VIII – Os Últimos Jedi (em inglês: Star Wars: The Last Jedi) é uma space opera épica estadunidense de 2017, escrita e dirigida por Rian Johnson, sendo o oitavo filme da franquia Star Wars e a sequência de Star Wars: O Despertar da Força, de 2015. Segundo filme da trilogia sequela, produzido pela Lucasfilm Ltd. e distribuído pela Walt Disney Studios Motion Pictures, é também o terceiro título da saga Star Wars de Kathleen Kennedy, após se tornar presidente da Lucasfilm e gerente de marca da franquia. Ram Bergman desempenhou o papel de produtor ao lado de Kathleen.Em junho de 2014, foi confirmado que Rian Johnson iria escrever e dirigir o oitavo episódio da franquia, e também escrever o tratamento do Star Wars: The Rise of Skywalker.[7] Daisy Ridley, Mark Hamill, John Boyega, Oscar Isaac, e demais membros do elenco estarão de volta em seus papéis anteriores, com inclusão de novos membros ao elenco: Benicio del Toro, Laura Dern, e Kelly Marie Tran. As filmagens tiveram início em fevereiro de 2016 e terminaram em julho do mesmo ano.",
            "image_url": "https://upload.wikimedia.org/wikipedia/pt/thumb/0/0e/Star_Wars_The_Last_Jedi.png/250px-Star_Wars_The_Last_Jedi.png",
            "trailer_url": "https://www.youtube.com/watch?v=Q0CbN8sfihY"
        },
        {
            "id": 10,
            "title": "Episódio IX",
            "subtitle": "A Ascensão Skywalker",
            "description": "Star Wars: The Rise of Skywalker (no Brasil, Star Wars: Episódio IX – A Ascensão Skywalker[3]; em Portugal, Star Wars: A Ascensão de Skywalker), também conhecido como Star Wars: Episode IX – The Rise of Skywalker, é uma space opera épica estadunidense de 2019, escrito por J. J. Abrams em colaboração com Chris Terrio e dirigido por Abrams, sendo o nono filme da franquia Star Wars, a sequência de Star Wars: Os Últimos Jedi, de 2017, e a terceira e última parcela da trilogia sequela, além do último filme da saga como um todo. Produzida pela Lucasfilm Ltd. e Bad Robot Productions e distribuído pela Walt Disney Studios Motion Pictures, é estrelado por Daisy Ridley, Adam Driver, John Boyega, Oscar Isaac, Lupita Nyong'o, Domhnall Gleeson, Kelly Marie Tran, Joonas Suotamo, Billie Lourd, Naomi Ackie, Richard E. Grant, Keri Russell, Mark Hamill, Anthony Daniels, Billy Dee Williams, Carrie Fisher e Ian McDiarmid. Star Wars: The Rise of Skywalker foi lançado nos Estados Unidos em 20 de dezembro de 2019. No Brasil e em Portugal, a estreia foi no dia 19 de dezembro de 2019.",
            "image_url": "https://upload.wikimedia.org/wikipedia/pt/thumb/0/08/Star_Wars_The_Rise_of_Skywalker.jpg/250px-Star_Wars_The_Rise_of_Skywalker.jpg",
            "trailer_url": "https://www.youtube.com/watch?v=8Qn_spdM5Zg"
        }
    ],

    
    "personagens": [
        {
            "id": 11,
            "title": "Darth Vader",
            "subtitle": "Anakin Skywalker",
            "description": "Darth Vader, nascido como Anakin Skywalker, é um dos personagens centrais da série de filmes Star Wars (Guerra nas Estrelas), tendo sido um dos protagonistas, juntamente com Obi-Wan Kenobi, da trilogia prequel (mas se tornando o vilão secundário no terceiro filme após a morte do General Grievous), um dos antagonistas principais da trilogia original ao lado do Imperador Palpatine (porém acaba se redimindo no final), e um anti-herói póstumo na trilogia de sequência, sendo que suas ações ainda afetam o universo de Star Wars, sendo para o bem ou para o mal, principalmente quando se trata de seu neto, Ben Solo, o Kylo Ren, que tem por Vader uma admiração cega, e deseja mais do que tudo ser como ele (e até superá-lo). [1][2][3]. Vader participou de seis episódios (A Ameaça Fantasma, Ataque dos Clones, A Vingança dos Sith, Uma Nova Esperança, O Império Contra-Ataca e O Retorno de Jedi) [4][5] e também participou do spin-off Rogue One, além de ser constantemente citado em O Despertar da Força, Os Últimos Jedi e em A Ascenção Skywalker. Suas principais características são a armadura preta e a ruidosa respiração mecânica. É constantemente citado na cultura pop como um dos personagens mais icônicos de todos os tempos. É um dos poucos personagens da saga que estiveram presentes e tiveram ao menos uma menção em todos os 9 episódios lançados até hoje.",
            "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/SWCE_-_EuroVader_%28801375039%29.jpg/200px-SWCE_-_EuroVader_%28801375039%29.jpg"
        },
        {
            "id": 12,
            "title": "Yoda",
            "subtitle": "Mestre Jedi",
            "description": "Medindo 76 centímetros de altura, Yoda é um membro de uma espécie de nome desconhecido. Ele foi o Grão Mestre da Ordem Jedi durante as Guerras Clônicas, um dos membros mais importantes do Alto Conselho Jedi nos últimos dias da República Galáctica, e um dos mais sábios e poderosos Jedi de todos os tempos. Tendo vivido por muito tempo (veio a falecer com aprox. 900 anos de idade), ele tinha excepcionais habilidades no combate de sabre de luz, onde usava as técnicas acrobáticas da Forma IV, além de um fenomenal conhecimento sobre a Força. De 300 ABY até 19 ABY ele treinou quase todos os Jedi da Galáxia — como Grande Mestre, ele instruia todos os Younglings do Templo Jedi antes deles serem adotados por um mestre, tendo Anakin Skywalker sido uma exceção quanto a isso. O estudante mais importante de Yoda foi Luke Skywalker, o qual Yoda treinou para ser o futuro da Ordem após a sua quase completa destruição após a execução da Ordem 66. Tendo treinado o primeiro membro da Nova Ordem Jedi, Yoda serviu como canal entre as duas ordens, preservando a chama Jedi para uma próxima geração.",
            "image_url": "https://upload.wikimedia.org/wikipedia/pt/thumb/4/45/Yoda.jpg/200px-Yoda.jpg"
        },
        {
            "id": 13,
            "title": "Luke Skywalker",
            "subtitle": "Mestre Jedi",
            "description": "Luke Skywalker é o protagonista da trilogia original da série Star Wars, faz participação em Star Wars: O Despertar da Força em Star Wars: Os Últimos Jedi. É interpretado pelo ator norte-americano Mark Hamill. Um personagem essencial e importante na luta da Aliança Rebelde contra o Império Galáctico, é o irmão gêmeo da líder rebelde Princesa Leia Organa de Alderaan, foi amigo do mercenário Han Solo, aprendiz do Mestre Jedi yoda mestre yoda, e o filho do Jedi caído Darth Vader (Anakin Skywalker) e da Rainha de Naboo/Senadora da República Padmé Amidala. Ele é o tio e antigo mestre de Kylo Ren, antes deste ter se convertido ao Lado Negro da Força. Em 2008, o personagem foi escolhido pela revista Empire como o 54º maior personagem de filmes de todos os tempos.[1] Em sua lista dos 100 Maiores Personagens de Ficção, a Fandomania.com classificou Luke na 14ª posição.[2]",
            "image_url": "https://upload.wikimedia.org/wikipedia/pt/thumb/c/cf/LukeTatooine.jpg/200px-LukeTatooine.jpg"
        },
        {
            "id": 14,
            "title": "Chewbacca",
            "subtitle": "Chewie",
            "description": "O Chewbacca é um republicano em A Vingança dos Sith, e um rebelde a partir de Uma Nova Esperança. Chewbacca nasceu em Kashyyyk 200 anos antes da Batalha de Yavin. Junto com outros wookiees ele combateu as forças de Palpatine (Darth Sidious) e do Império Galáctico, sendo o único sobrevivente de uma missão para salvar filhotes Wookiees de escravistas. Libertado por Han Solo, torna-se seu amigo, pois, segundo a cultura Wookiee, ele tem um débito de vida com aquele que o salvou.[2] Chewbacca é casado com Mallatobuck e a tradição permite que ele se ausente do lar para cumprir sua dívida de honra. Ele e Han Solo se tornam contrabandistas a serviço dos Hutts. Chewie acompanha todas as aventuras e influencia o amigo a ajudar a Aliança Rebelde. Grande mecânico, esse wookie usa tal habilidade para resolver diversos problemas da nave Millennium Falcon, e em O Império Contra-Ataca, Chewbacca remonta C-3PO e quando ele é destruído pelos soldados imperiais na Cidade das Nuvens, em Bespin. Seu instinto animal também o colocou numa encrenca na lua florestal de Endor em O Retorno de Jedi, quando fareja uma presa (que na verdade era uma armadilha feita por Ewoks). Além de sua força natural e de suas garras retráteis, ele usa como arma principal sua besta a laser. Chewbacca é um jogador de xadrez dejarik holográfico muito temperamental, e seus adversários correm o risco de ter os braços arrancados durante a partida, se Chewie estiver perdendo.",
            "image_url": "https://static.wikia.nocookie.net/ptstarwars/images/7/7f/ChewbaccaTFAHS-Fathead.png/revision/latest/top-crop/width/360/height/450?cb=20151218200951"
        },
        {
            "id": 15,
            "title": "Han Solo",
            "subtitle": "Chewie",
            "description": "Han Solo é um mercenário, nativo do planeta Corellia, mas residente em Tatooine. É proprietário da nave espacial Millennium Falcon, antigo cargueiro corelliano, modificado por Solo, descrita por ele como a nave mais veloz da galáxia e tem como co-piloto o wookiee Chewbacca. Precisando de dinheiro urgentemente para pagar o credor Jabba the Hutt, Han aceita transportar Luke Skywalker e Obi-Wan Kenobi para o planeta Alderaan.Porém, ao chegarem lá, só acham um cinturão de asteroides, pois o planeta foi destruído pela arma letal Estrela da Morte. E é para lá que a Falcon se dirige, sendo capturada pelo raio trator. Han, Luke e Chewbacca resolvem ir ao resgate da Princesa Leia, que estava na área de confinamento, enquanto Obi-Wan vai desligar o raio trator. Han e Luke são bem-sucedidos, mas Obi-Wan, apesar de ter desligado o raio, acaba morrendo em duelo com Darth Vader. A Falcon foge para a base da Aliança Rebelde. Ao receber seu pagamento, Han resolve ir embora, apesar dos apelos de Luke para ajudar no ataque à Estrela da Morte. Porém, quando a nave de Luke está prestes a ser abatida, a Falcon aparece e o salva, permitindo a ele dar os disparos fatais. Han e Chewbacca unem-se à Aliança Rebelde.",
            "image_url": "https://upload.wikimedia.org/wikipedia/pt/thumb/f/f4/HanSolo.jpg/200px-HanSolo.jpg"
        },
        {
            "id": 16,
            "title": "Princesa Leia",
            "subtitle": "Leia Organa",
            "description": "Leia Organa (nascida Leia Amidala Skywalker) era uma Humana sensível à Força que serviu como Princesa de Alderaan, membro do Senado Imperial, General da Aliança pela Restauração da República e da Nova República, e a general fundadora da Resistência. Apesar de tudo, ela se tornou fundamental na derrota do Império Galáctico na Guerra Civil Galáctica e liderou a guerra contra a Primeira Ordem. Ela nasceu dezenove anos antes da Batalha de Yavin como filha do Cavaleiro Jedi Anakin Skywalker e da Senadora Padmé Amidala. Depois que sua mãe morreu e seu pai caiu para o lado sombrio da Força para se tornar Darth Vader, Leia foi adotada pela Casa dos Organa. Ela tomou o lugar de seu pai adotivo, Bail Organa, no Senado e ajudou a liderar a batalha contra o Império.",
            "image_url": "https://static.wikia.nocookie.net/ptstarwars/images/f/fc/Leia_Organa_TLJ.png/revision/latest/scale-to-width-down/350?cb=20180331155538"
        }
    ]
}